// 获取所有目录项
let catalogueItems = document.querySelectorAll('.catalogue .all-div');
// 获取yellow_bg盒子
let yellowBgDiv = document.querySelector('.yellow_bg')
let yellowBgName = document.querySelector('.yellow_bg .name')
let yellowBgContent = document.querySelector('.yellow_bg .content')

let mainWin = document.querySelector('.manyWindows')
let homeJumpDiv = document.querySelector('.homeJump')
let listenersMap = new Map();
const datas = {
    citys: [
        {
            cityId: 1,
            cityName: "阿坝",
            herbs: [
                {
                    herbId: 1,
                    herbName: "大黄",
                    img: '../images/herbsImg/阿坝/大黄.png',
                    functions: "治实热便秘，谵语发托，食积痞满，痢疾初起，里急后重，瘀停经闭，癥瘕积聚，时行热疫，暴眼赤痛，吐血，衄血，阳黄，水肿，淋浊，溲亦，痈疡肿毒，疔疮，汤火伤。",
                    mainFunc: "泻热毒，破积滞，行瘀血。治实热便秘，谵语，食积痞满，痢疾初起，里急后重，瘀停经闭，癥瘕积聚，时行热疫，暴眼赤痛，吐血，衄血，阳黄，水肿，淋浊，痈疡肿毒，疔疮，汤火伤。",
                    character: "本品呈类圆柱形、圆锥形、卵圆形或不规则块状，长3～17cm，直径3～10cm。除尽外皮者表面黄棕色至红棕色，有的可见类白色网状纹理及星点（异型维管束）散在，残留的外皮棕褐色，多具绳孔及粗皱纹。质坚实，有的中心稍松软，断面淡红棕色或黄棕色，显颗粒性；根茎髓部宽广，有星点环列或散在；根木部发达，具放射状纹理，形成层环明显，无星点。气清香，味苦而微涩，嚼之粘牙，有砂粒感。",
                    literature: [
                        {
                            bookId: 1,
                            bookName: "《本草经集庄》",
                            content: "黄芩为之使。"
                        },
                        {
                            bookId: 2,
                            bookName: "《药性论》",
                            content: "忌冷水。恶干漆。"
                        },
                        {
                            bookId: 3,
                            bookName: "《本草经疏》",
                            content: "凡血闭由于血枯，而不由于热积；寒热由于阴虚，而不由于瘀血；癥瘕由于脾胃虚弱，而不由于积滞停留；便秘由于血少肠燥，而不由于热结不通；心腹胀满由于脾虚中气不运，而不由于饮食停滞；女子少腹痛由于厥阴血虚，而不由于经阻老血瘀结；吐、衄血由于阴虚火起于下，炎烁乎上，血热妄行，溢出上窍，而不由于血分实热；偏坠由于肾虚，湿邪乘虚客之而成，而不由于湿热实邪所犯；乳痈肿毒由于盱家气逆，郁郁不舒，以致营气不从，逆于肉里，乃生痈肿，而不由于膏粱之变，足生大疔，血分积热所发，法咸忌之，以其损伤胃气故耳。"
                        },
                        {
                            bookId: 4,
                            bookName: "《本草汇言》",
                            content: "凡病在气分，及胃寒血虚，并妊娠产后，及久病年高之人，并勿轻用大黄。"
                        },
                        {
                            bookId: 5,
                            bookName: "《本经逢原》",
                            content: "肾虚动气及阴疽色白不起等证，不可妄用。"
                        }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "天麻",
                    img: '../images/herbsImg/阿坝/天麻.png',
                    functions: "为兰科植物天麻的根茎。 主治急慢惊风，抽搐拘挛，眩晕，头痛，半身不遂，肢麻，风湿痹痛。",
                    mainFunc: "息风止痉，平肝阳；祛风通络。主急慢惊风，抽搐拘挛，眩晕，头痛，半身不遂，肢麻，风湿痹痛。",
                    character: "干燥根茎为长椭圆形，略扁，皱缩而弯曲，一端有残留茎基，红色或棕红色，俗称鹦哥嘴，另一端有圆形的根痕，长6～10厘米，直径2～5厘米，厚0.9～2厘米。表面黄白色或淡黄棕色，半透明，常有浅色片状的外皮残留，多纵皱，并可见数行不甚明显的须根痕排列成环。冬麻皱纹细而少，春麻皱纹粗大。质坚硬，不易折断。断面略平坦，角质，黄白色或淡棕色，有光泽。嚼之发脆，有粘性。气特异，味甘。以色黄白、半透明、肥大坚实者为佳。色灰褐、外皮未去净、体轻、断面 中空者为次。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主恶气，久服益气力，长阴肥健。" },
                        { bookId: 2, bookName: "《别录》", content: "消痈肿，下支满，疝，下血。" },
                        { bookId: 3, bookName: "《药性论》", content: "治冷气顽痹，瘫缓不遂，语多恍惚，多惊失志。" },
                        { bookId: 4, bookName: "《日华子本草》", content: "助阳气，补五劳七伤，通血脉，开窍。" },
                        { bookId: 5, bookName: "《开宝本草》", content: "主诸风湿痹，四肢拘挛，小儿风痫、惊气，利腰膝，强筋力。" }
                    ]
                },
                {
                    herbId: 3,
                    herbName: "三七",
                    img: '../images/herbsImg/阿坝/三七.png',
                    functions: "为五加科人参属植物三七的块根。 主治吐血，咳血，衄血，便血，血痢，崩漏，癥瘕，产后血晕，恶露不下，跌扑瘀血，外伤出血，痈肿疼痛。",
                    mainFunc: "止血，散瘀，消肿，定痛。治吐血，咳血，衄血，便血，血痢，崩漏，癥瘕，产后血晕，恶露不下，跌扑瘀血，外伤出血，痈肿疼痛。",
                    character: "干燥的根，呈不规则类圆柱形或纺锤形，长约3～5厘米，直径约0.3～3厘米，顶端有根茎残基。外表灰黄色或棕黑色，有光泽，具断续的纵皱纹，及横向隆起之皮孔，并有支根的断痕。质坚实，不易折断，断面木部与皮部常分离，皮部黄色、灰色或棕黑色，本部角质光滑，有放射状纹理。气微，味先苦而后微甜。以个大坚实、体重皮细、断面棕黑色、无裂痕者为佳。筋条、剪口及绒根大多不饱满而有较多的纵皱，并带有灰黄色的栓皮。易折断，断面颗粒状或角质状。",
                    literature: [
                        { bookId: 1, bookName: "《纲目》", content: "止血，散血，定痛。金刃箭伤，跌扑杖疮，血出不止者，嚼烂涂，或为末掺之，其血即止。亦主吐血，衄血，下血，血痢，崩中，经水不止，产后恶血不下，血运，血痛，赤目，痈肿，虎咬，蛇伤诸病。" },
                        { bookId: 2, bookName: "《玉揪药解》", content: "和营止血，通脉行瘀，行瘀血而敛新血。凡产后、经期、跌打、痈肿，一切瘀血皆破；凡吐衄、崩漏、刀伤、箭射，一切新血皆止。" }
                    ]
                },
                {
                    herbId: 4,
                    herbName: "虫草",
                    img: '../images/herbsImg/阿坝/冬虫夏草.png',
                    functions: "为麦角菌科真菌冬虫夏草菌的子座及其寄主蝙蝠蛾科昆虫虫草蝙蝠蛾等的幼虫体(菌核)的复合体。 主治痰饮喘嗽，虚喘，痨嗽，咯血，自汗盗汗，阳痿遗精，腰膝酸痛，病后久虚不复。",
                    mainFunc: "补虚损，补肺益肾，止咳化痰。治痰饮喘嗽，虚喘，痨嗽，咯血，自汗盗汗，阳痿遗精，腰膝酸痛，病后久虚不复。",
                    character: "本品由虫体及从头部长出的真菌子座组成。虫体似蚕，长3~5cm，直径3~8mm，表面深棕黄色至黄棕色，有环纹20~30个，近头部的环纹较细；头部红棕色，足8对，中部4对较明显；质脆，易折断，断面略平坦，淡黄白色。子座单生，细长圆柱形，长4~7cm，直径约3mm；表面深棕色至棕褐色，有细纵皱 纹，上部稍膨大，头部与柄无明显区别；质柔韧，断面类白色。气微腥，味淡。以虫体色泽黄亮，丰满肥大，断面黄白色，子座短小者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《本草从新》", content: "保肺益肾，止血化痰，已劳嗽。" },
                        { bookId: 2, bookName: "《药性考》", content: "秘精益气，专补命门。" },
                        { bookId: 3, bookName: "《柑园小识》", content: "以酒浸数枚啖之，治腰膝间痛楚，有益肾之功。" },
                        { bookId: 4, bookName: "《纲目拾遗》", content: "潘友新云治膈症，周兼士云治蛊胀。" },
                        { bookId: 5, bookName: "《现代实用中药》", content: "适用于肺结核、老人衰弱之慢性咳嗽气喘，吐血、盗汗、自汗；又用于贫血虚弱，阳痿遗精，老人畏寒，涕多泪出等证。" }
                    ]
                }
            ]
        },
        {
            cityId: 2,
            cityName: "甘孜",
            herbs: [
                {
                    herbId: 1,
                    herbName: "秦艽",
                    img: '../images/herbsImg/甘孜州/秦艽.png',
                    functions: "本 品为龙胆科植物秦艽、麻花秦艽、粗茎秦艽或小秦艽的干燥根。 主治风湿痹痛，筋骨拘挛，黄疸，便血，骨蒸潮热，小儿疳热，小便不利。",
                    mainFunc: "祛风除湿，和血舒筋，清热利尿。治风湿痹痛，筋骨拘挛，黄疸，便血，骨蒸潮热，小儿疳热，小便不利。",
                    character: "呈类圆柱形，上粗下细，扭曲不直，长10～30cm，直径1～3cm。表面黄棕色或灰黄色，有纵向或扭曲的纵皱纹，顶端有残存茎基及纤维状叶鞘。质硬而脆，易折断，断面略显油性，皮部黄色或棕黄色，木部黄色。气特异，味苦、微涩。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主寒热邪气，寒湿风痹，肢节痛，下水，利小便。" },
                        { bookId: 2, bookName: "《别录》", content: "疗风，无问久新；通身挛急。" },
                        { bookId: 3, bookName: "《药性论》", content: "利大小便，瘥五种黄病，解酒毒，去头风。" },
                        { bookId: 4, bookName: "《医学启源》", content: "治口噤，肠风泻血。《主治秘要》云，养血荣筋，中风手足不遂者用之。去手足阳明下牙痛，以去本经风湿。" },
                        { bookId: 5, bookName: "《日华子本草》", content: "主骨蒸，治疳及时气。" }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "羌活",
                    img: '../images/herbsImg/甘孜州/羌活.png',
                    functions: "为伞形科植物羌活或宽叶羌活的根茎和根。 用于阳痿遗精，遗尿尿频，腰膝冷痛，肾虚作喘，五更泄泻；外用治白癜风，斑秃。解表散寒，祛风胜湿，止痛。",
                    mainFunc: "散表寒，祛风湿，利关节。治感冒风寒，头痛无汗，风寒湿痹，项强筋急，骨节酸疼，风水浮肿，痈疽疮毒。用于阳痿遗精，遗尿尿频，腰膝冷痛，肾虚作喘，五更泄泻；外用治白癜风，斑秃。",
                    character: "为圆柱形略弯曲的根茎，长4~13cm，直径0.6~2.5cm。顶端具茎痕。表面棕褐色至黑褐色，外皮脱落处呈黄色。节间缩短，呈紧密隆起的环状，形似蚕（习称蚕羌）；或节是延长，形如竹节状（习称竹节羌）。节上有多数点状或瘤状突起的根良及色破碎鳞片。体轻，质脆，易折断。断面不平整，有多数裂隙，皮部黄棕色至暗棕色，油润，有棕色油点，木部黄白色，射线明显，髓部黄色至黄棕色。气香，味微苦而辛。",
                    literature: [
                        { bookId: 3, bookName: "《珍珠囊》", content: "太阳经头痛，去诸骨节疼痛，亦能温胆。" },
                        { bookId: 4, bookName: "《品汇精要》", content: "主遍身百节疼痛，肌表八风贼邪，除新旧风湿，排腐肉疽疮." },
                        { bookId: 5, bookName: "《本草备要》", content: "泻肝气，搜肝风，治风湿相搏，本经（太阳）头痛，督脉为病，脊强而厥，刚痉柔痉，中风不语，头旋目赤。" },
                        { bookId: 6, bookName: "《会约医镜》", content: "治邪闭憎寒，壮热无汗。" }
                    ]
                },
                {
                    herbId: 3,
                    herbName: "川贝母",
                    img: '../images/herbsImg/甘孜州/川贝母.png',
                    functions: "川贝为百合科植物川贝母、暗紫贝母、甘肃贝母、梭砂贝母的干燥鳞茎。 主治虚劳咳嗽，吐痰咯血，心胸郁结，肺痿，肺痈，瘿瘤，廉疬，喉痹，乳痈。",
                    mainFunc: "清热润肺，散结，化痰止咳。治虚劳咳嗽，吐痰咯血，心胸郁结，肺痿，肺痈，瘿瘤，廉疬，喉痹，乳痈。",
                    character: "暗紫贝母、卷叶贝母、甘肃贝母的鳞茎，按性状不同分别习称松贝和青贝，棱砂贝母习称炉贝。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主伤寒烦热，淋沥邪气，疝瘕，喉痹，乳难，金疮风痉。" },
                        { bookId: 2, bookName: "《别录》", content: "疗腹中结实，心下满，洗洗恶风寒，目眩，项直，咳嗽上气，止烦热渴，出汗，安五脏，利骨髓。" },
                        { bookId: 3, bookName: "《药性论》", content: "治虚热，主难产作末服之；兼治胞衣不出，取七枚末，酒下；末，点眼去肤翳；主胸胁逆气，疗时疾黄疸，与连翘同主项下瘤瘿疾。" },
                        { bookId: 4, bookName: "《日华子本草》", content: "消痰，润心肺。末，和砂糖为丸含，止嗽；烧灰油敷人畜恶疮。" },
                        { bookId: 5, bookName: "《本草别说》", content: "能散心胸郁结之气。" }
                    ]
                }
            ]
        },
        {
            cityId: 3,
            cityName: "成都",
            herbs: [
                {
                    herbId: 1,
                    herbName: "葛根",
                    img: '../images/herbsImg/成都/葛根.png',
                    functions: "本品为豆科植物野葛或甘葛藤的干燥根。主治伤寒、温热头痛项强，烦热消渴，泄泻，痢疾，癍疹不透，高血压，心绞痛，耳聋。",
                    mainFunc: "升阳解肌，透疹止泻，除烦止温。治伤寒、温热头痛项强，烦热消渴，泄泻，痢疾，癍疹不透，高血压，心绞痛，耳聋。",
                    character: "野葛根完整的多呈圆柱形。商品常为斜切、纵切、横切的片块，大小不等。表面褐色，具纵皱纹，可见横向皮孔和不规则的须根痕。质坚实，断面粗糙，黄白色，隐约可见l-3层同心环层。纤维性强，略具粉性。气微、味微甜。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主消渴，身太热，呕吐，诸痹，起阴气，解诸毒。" },
                        { bookId: 2, bookName: "《别录》", content: "疗伤寒中风头痛，解肌，发表，出汗，开腠理。疗金疮，止痛，胁风痛。生根汁，疗消渴，伤寒壮热。" },
                        { bookId: 3, bookName: "《本草经集注》", content: "杀野葛、巴豆、百药毒。" },
                        { bookId: 4, bookName: "陶弘景", content: "生者捣取汁饮之，解温病发热。葛根为屑，疗金疮断血，亦疗疟及疮。" },
                        { bookId: 5, bookName: "《药性论》", content: "治天行上气，呕逆，开胃下食，主解酒毒，止烦渴。熬屑治金疮，治时疾解热。" },
                        { bookId: 6, bookName: "《唐本草》", content: "末服之，主猘狗啮，并饮其汁良。" }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "熊胆",
                    img: '../images/herbsImg/成都/熊胆.png',
                    functions: "为熊科动物黑熊或棕熊的胆囊。主治热黄，暑泻，小儿惊痼，疳疾，蛔虫痛，目翳，喉痹，鼻蚀，疔痔恶疮。",
                    mainFunc: "清热，镇痉，明目，杀虫。治热黄，暑泻，小儿惊痼，疳疾，蛔虫痛，目翳，喉痹，鼻蚀，疔痔恶疮。",
                    character: "干燥胆囊呈长扁卵形，上部狭细，下部膨大，长10～20厘米，宽5～8厘米。表面灰黑色或棕黑色，显光泽，有皱褶，囊皮薄，迎光视之，上部常呈半透明。质坚硬，破开后，断面纤维性。囊内藏有干燥胆汁，习称胆仁，呈块状、颗粒状、粉末状或稠膏状。",
                    literature: [
                        { bookId: 4, bookName: "《医学入门》", content: "点眼去翳开盲。涂恶疮、痔瘘。" },
                        { bookId: 5, bookName: "《纲目》", content: "退热，清心，平肝，明目去翳，杀蛔、蛲虫。" },
                        { bookId: 6, bookName: "《本草述》", content: "治喉痹。" },
                        { bookId: 7, bookName: "《本草求原》", content: "治蓄血，血淋。" },
                        { bookId: 8, bookName: "《随息居饮食谱》", content: "治疔疽。" }
                    ]
                },
                {
                    herbId: 3,
                    herbName: "羊肚菌",
                    img: '../images/herbsImg/成都/羊肚菌.png',
                    functions: "真菌类子囊菌纲盘菌目马鞍菌科羊肚菜，以子实体入药。用于消化不良，痰多气短。",
                    mainFunc: "益肠胃，化痰理气。用于消化不良，痰多气短。",
                    character: "柄近圆柱形，近白色，中空，上部平滑，基部膨大并有不规则的浅凹槽，长5-7厘米，粗约为菌盖的2/3。子囊圆筒形，孢子长椭圆形，无色，每个子囊内含8个，呈单行排列。侧丝顶端膨大，粗达12微米，体轻，质酥脆。",
                    literature: [
                        { bookId: 1, bookName: "《本草纲目》", content: "羊肚菌，性平，味甘，具有益肠胃，消化助食，化痰理气，补肾纳气，补脑提神之功效。" }
                    ]
                }
            ]
        },
        {
            cityId: 4,
            cityName: "巴中",
            herbs: [
                {
                    herbId: 1,
                    herbName: "银耳",
                    img: '../images/herbsImg/巴中/银耳.png',
                    functions: "为真菌类银耳科银耳属植物银耳，以子实体入药。治虚劳咳嗽，痰中带血，虚热口渴。",
                    mainFunc: "补肺益气，养阴润燥。用于病后体虚，肺虚久咳，痰中带血，崩漏，大便秘结，高血压病，血管硬化。",
                    character: "子实体由数片至10余片薄而多皱褶的瓣片组成，呈菊花形、牡丹花形或绣球形，直径3~15cm，白色或类黄色，表面光滑，有光泽，基蒂黄褐色。角质，硬而脆。浸泡水中膨胀，有胶质。气微，味淡。",
                    literature: [
                        { bookId: 1, bookName: "《本草再新》", content: "润肺滋阴。" },
                        { bookId: 2, bookName: "《本草问答》", content: "治口干肺痿，痰郁咳逆。" },
                        { bookId: 3, bookName: "《饮片新参》", content: "清补肺阴，滋液，治劳咳。" },
                        { bookId: 4, bookName: "《增订伪药条辨》", content: "治肺热肺燥，干咳痰嗽；衄血，咯血，痰中带血。" }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "木瓜",
                    img: '../images/herbsImg/巴中/木瓜.png',
                    functions: "为蔷薇科植物皱皮木瓜的果实。主治吐泻转筋，湿痹，脚气，水肿，痢疾。",
                    mainFunc: "平肝和胃，去湿舒筋。治吐泻转筋，湿痹，脚气，水肿，痢疾。",
                    character: "果实多呈纵剖成对半的长圆形，长4~9cm，宽2~5cm，厚1~2.5cm。外表面紫红色或红棕色，有不规则深皱纹；剖面边缘向内卷曲，果肉红棕色，中心部分凹陷，棕黄色。种子扁长三角形，多脱落，质坚硬。气微清香，味酸。以质坚实、味酸者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《雷公炮炙论》", content: "调营卫，助谷气。" },
                        { bookId: 2, bookName: "《别录》", content: "主湿痹邪气，霍乱大吐下，转筋不止。" },
                        { bookId: 3, bookName: "《食疗本草》", content: "治呕畹风气，吐后转筋，煮汁饮之。" },
                        { bookId: 4, bookName: "《本草拾遣》", content: "下冷气，强筋骨，消食，止水痢后渴不止，作饮服之。又脚气冲心，取一颗去子，煎服之，嫩者更佳。又止呕逆，心膈痰唾。" },
                        { bookId: 5, bookName: "《海药本草》", content: "敛肺和胃，理脾伐肝，化食止渴。" }
                    ]
                },
                {
                    herbId: 3,
                    herbName: "乌药",
                    img: '../images/herbsImg/巴中/乌药.png',
                    functions: "为樟科植物乌药的根。主治气逆胸腹胀痛，宿食不消，反胃吐食，寒疝，脚气，小便频数。",
                    mainFunc: "顺气，开郁，温肾散寒，止痛。治气逆胸腹胀痛，宿食不消，反胃吐食，寒疝，脚气，小便频数。",
                    character: "呈纺锤形，略弯曲，两头稍尖，中部膨大，或成连珠状，长10～15厘米；膨大部直径1～2厘米。表面黄棕色或黄褐色，有须根残痕，具纵皱及横裂纹，质坚硬，不易折断，横切面类圆形，浅棕色而微红，稍显粉性，中心色较深，外层皮部棕色，甚薄；木质部有放射状纹理及环纹。气微香，味微辛苦。",
                    literature: [
                        { bookId: 1, bookName: "《本草拾遗》", content: "主中恶心腹痛，宿食不消，天行疫瘴，膀胱肾间冷气攻冲背膂，妇人血气，小儿腹中诸虫。" },
                        { bookId: 2, bookName: "《日华子本草》", content: "治一切气，除一切冷，霍乱及反胃吐食.泻痢，痈疖疥癞，并解冷热。" },
                        { bookId: 3, bookName: "王好古", content: "理元气。" },
                        { bookId: 4, bookName: "《纲目》", content: "治中气，脚气，疝气，气厥头痛，肿胀喘息，止小便数及白浊。" },
                        { bookId: 5, bookName: "《本草通玄》", content: "理七情郁结，气血凝停，霍乱吐泻，痰食稽留。" }
                    ]
                }
            ]
        },
        {
            cityId: 5,
            cityName: "达州",
            herbs: [
                {
                    herbId: 1,
                    herbName: "石菖蒲",
                    img: '../images/herbsImg/达州/石菖蒲.png',
                    functions: "本品为天南星科植物石菖蒲的干燥根茎。主治癫痫，痰厥，热病神昏，健忘，气闭耳聋，心胸烦闷，胃痛，腹痛，风寒湿痹，痈疽肿毒，跌打损伤。",
                    mainFunc: "开窍，豁痰，理气，活血，散风，去湿。治癫痫，痰厥，热病神昏，健忘，气闭耳聋，心胸烦闷，胃痛，腹痛，风寒湿痹，痈疽肿毒，跌打损伤。",
                    character: "本品呈扁圆柱形，多弯曲，常有分枝，长3～20cm，直径0.3～1cm。表面棕褐色或灰棕色，粗糙，有疏密不匀的环节，节间长0.2～0.8cm，具细纵纹，一面残留须根或圆点状根痕；叶痕呈三角形，左右交互排列，有的其上有毛鳞状的叶基残余。质硬，断面纤维性，类白色或微红色，内皮层环明显，可见多数维管束小点及棕色油细胞。气芳香，味苦、微辛。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主风寒湿痹，咳逆上气，开心孔，补五脏，通九窍，明耳目，出音声。" },
                        { bookId: 2, bookName: "《别录》", content: "主耳聋，痈疮，温肠胃，止小便利，四肢湿痹，不得屈伸，小儿温疟，身积热不解，可作浴汤。聪耳目，益心智。" },
                        { bookId: 3, bookName: "《药性论》", content: "治风湿顽痹，耳鸣，头风，泪下，杀诸虫，治恶疮疥瘙。" },
                        { bookId: 4, bookName: "《日华子本草》", content: "除风下气，除烦闷，止心腹痛，霍乱转筋。治客风疮疥，涩小便，杀腹藏虫。耳痛：作末、炒，承热裹窨，甚验。" },
                        { bookId: 5, bookName: "王好古", content: "治心积伏粱。" },
                        { bookId: 6, bookName: "《滇南本草》", content: "治九种胃气，止疼痛。" }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "云木香",
                    img: '../images/herbsImg/达州/云木香.png',
                    functions: "为菊科物木香的根。主治中寒气滞，胸腹胀痛，呕吐，泄泻，下痢里急后重，寒疝。",
                    mainFunc: "行气止痛，温中和胃。治中寒气滞，胸腹胀痛，呕吐，泄泻，下痢里急后重，寒疝。",
                    character: "根圆柱形、平圆柱形，长5~15cm，直径0.5~5.5cm。表面黄棕色、灰褐色或棕褐色，栓皮大多已除去，有明纵沟及侧根痕，有时可见网状纹理。质坚硬，难折断，断面稍平坦，灰黄色、灰褐色或棕褐色，散有深褐色油室小点，形成层环棕色，有放射状纹理，老根中央多枯朽。气芳香浓烈而特异，味先甜后苦，稍 刺舌。以条匀、质坚实、没性足、香气浓郁者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主邪气，辟毒疫，强志，主淋露。" },
                        { bookId: 2, bookName: "《别录》", content: "疗气劣、肌中偏寒；主气不足，消毒，（治）温疟，行药之精。" },
                        { bookId: 3, bookName: "《本草经集注》", content: "疗毒肿，消恶气。" },
                        { bookId: 4, bookName: "《药性论》", content: "治女人血气刺心心痛不可忍，末，酒服之。治几种心痛，积年冷气，痃癣癥块，胀痛，逐诸壅气上冲烦闷。治霍乱吐泻，心腹疠刺。" },
                        { bookId: 5, bookName: "《日华子本草》", content: "治心腹一切气，止泻，霍乱，痢疾，安胎，健脾消食。疗羸劣，膀胱冷痛，呕逆反胃。" },
                        { bookId: 6, bookName: "王好古", content: "治冲脉为病，逆气里急。主脬渗小便秘。" },
                        { bookId: 7, bookName: "《本草通玄》", content: "理疝气" }
                    ]
                },
                {
                    herbId: 3,
                    herbName: "钩藤",
                    img: '../images/herbsImg/达州/钩藤.png',
                    functions: "本品为茜草科植物钩藤、大叶钩藤、毛钩藤、华钩藤或无柄果钩藤的干燥带钩茎枝。主治小儿惊痫瘈疭，大人血压偏高，头晕、目眩，妇人子痫。",
                    mainFunc: "清热平肝，熄风定惊。治小儿惊痫瘈疭，大人血压偏高，头晕、目眩，妇人子痫。",
                    character: "为干燥的带钩茎枝，茎枝略呈方柱形，长约2厘米，直径约2毫米，表面红棕色或棕褐色，一端有一环状的茎节，稍突起，节上有对生的两个弯钩，形如船锚，尖端向 内卷曲，亦有单钩的，钩大小不一，基部稍圆，径2～3毫米，全体光滑，略可见纵纹理。质轻而坚，不易折断，断面外层呈棕红色，髓部呈淡黄色而疏松如海绵 状。气无，味淡。以双钩形如锚状、茎细、钩结实、光滑、色红褐或紫褐者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《别录》", content: "主小儿寒热，惊痫。" },
                        { bookId: 2, bookName: "《药性论》", content: "主小儿惊啼，瘈疭热壅。" },
                        { bookId: 3, bookName: "《日华子本草》", content: "治客忤胎风。" },
                        { bookId: 4, bookName: "《纲目》", content: "大人头旋目眩，平肝风，除心热，小儿内钓腹痛，发斑疹。" },
                        { bookId: 5, bookName: "《本草征要》", content: "舒筋除眩，下气宽中。" }
                    ]
                }
            ]
        },
        {
            cityId: 6,
            cityName: "德阳",
            herbs: [
                {
                    herbId: 1,
                    herbName: "丹参",
                    img: '../images/herbsImg/德阳/丹参.png',
                    functions: "为唇形科植物丹参的根。主治心绞痛，月经不调，痛经，经闭，血崩带下，癥瘕，积聚，瘀血腹痛，骨节疼痛，惊悸不眠，恶疮肿毒。",
                    mainFunc: "祛瘀止痛，活血通经，清心除烦。治心绞痛，月经不调，痛经，经闭，血崩带下，癥瘕，积聚，瘀血腹痛，骨节疼痛，惊悸不眠，恶疮肿毒。",
                    character: "干燥根茎顶部常有茎基残余，根茎上生1至多数细长的榀。根略呈长圆柱形，微弯曲，有时分支，其上生多数细须根，根长约10～25厘米，直径约0.8～1.5 厘米，支根长约5～8厘米，直径约2～5毫米，表面棕红色至砖红色，粗糙，具不规则的纵皱或栓皮，多呈鳞片状剥落.质坚脆，易折断，断面不平坦，带角质或 纤维性，皮部色较深，呈紫黑色或砖红色，木部维管束灰黄色或黄白色，放射状排列。气弱，味甘微苦。以条粗、内紫黑色，有菊花状白点者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主心腹邪气，肠鸣幽幽如走水，寒热积聚；破癥除瘕，止烦满，益气。" },
                        { bookId: 2, bookName: "《吴普本草》", content: "治心腹痛。" },
                        { bookId: 3, bookName: "《别录》", content: "养血，去心腹痼疾结气，腰脊强，脚痹；除风邪留热，久服利人。" },
                        { bookId: 4, bookName: "陶弘景", content: "渍酒饮之，疗风痹。" },
                        { bookId: 5, bookName: "《药性论》", content: "治脚弱，疼痹，主中恶；治腹痛，气作声音呜吼。" },
                        { bookId: 6, bookName: "《日华子本草》", content: "养神定志，通利关脉。治冷热劳，骨节疼痛，四肢不遂；排脓止痛，生肌长肉；破宿血，补新生血；安生胎，落死胎；止血崩带下，调妇人经脉不匀，血邪心烦；恶疮疥癣，瘿赘肿毒，丹毒；头痛，赤眼，热温狂闷。" }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "白芍",
                    img: '../images/herbsImg/德阳/白芍.png',
                    functions: "本品为毛茛科植物芍药的干燥根。主治胸腹胁肋疼痛，泻痢腹痛，自汗盗汗，阴虚发热，月经不调，崩漏，带下。",
                    mainFunc: "养血柔肝，缓中止痛，敛阴收汗。治胸腹胁肋疼痛，泻痢腹痛，自汗盗汗，阴虚发热，月经不调，崩漏，带下。",
                    character: "干燥根呈圆柱形，粗细均匀而平直，长10～20厘米，直径1～1.8厘米。表面淡红棕色或粉白色，平坦，或有明显的纵皱及须根痕，栓皮未除尽处有棕褐色斑痕，偶见横向皮孔。质坚实而重，不易折断。断面灰白色或微带棕色，木部放射线呈菊花心状。气无，味微苦而酸。以根粗长、匀直、质坚实、粉性足、表面洁净者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主邪气腹痛，除血痹，破坚积，治寒热疝瘕，止痛，利小便，益气。" },
                        { bookId: 2, bookName: "《别录》", content: "通顺血脉，缓中，散恶血，逐贼血，去水气，利膀胱、大小肠，消痈肿，（治）时行寒热，中恶腹痛，腰痛。" },
                        { bookId: 3, bookName: "《药性论》", content: "治肺邪气，腹中疞痛，血气积聚，通宣脏腑拥气，治邪痛败血，主时疾骨热，强五脏，补肾气，治心腹坚胀，妇人血闭不通，消瘀血，能蚀脓。" },
                        { bookId: 4, bookName: "《唐本草》", content: "益女子血。" },
                        { bookId: 5, bookName: "《日华子本草》", content: "治风补痨，主女人一切病，并产前后诸疾，通月水，退热除烦，益气，治天行热疾，瘟瘴惊狂，妇人血运，及肠风泻血，痔瘘发背，疮疥，头痛，明目，目赤，胬肉。" }
                    ]
                },
                {
                    herbId: 3,
                    herbName: "白芥子",
                    img: '../images/herbsImg/德阳/白芥.png',
                    functions: "为十字花科植物白芥的种子。主治痰饮咳喘，胸胁胀满疼痛，反胃呕吐，中风不语，肢体痹痛麻木，脚气，阴疽，肿毒，跌打肿痛。",
                    mainFunc: "利气豁痰，温中散寒，通络止痛。治痰饮咳喘，胸胁胀满疼痛，反胃呕吐，中风不语，肢体痹痛麻木，脚气，阴疽，肿毒，跌打肿痛。",
                    character: "种子近球形，直径2~2.5mm。表面淡黄白色，光滑，在放大镜下观察，可见细微的网纹，一端具一圆形淡褐色的种脐，浸水中膨胀，去种皮可见2片肥厚的子叶，油质，相互纵向摺叠，胚根包藏于其间。气微，味辛辣，粉碎湿润后，有特殊的辛烈臭气。以粒大、饱满、色黄白、纯净者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《别录》", content: "发汗，主胸膈痰冷上气，面口黄赤。又醋研敷射工毒。" },
                        { bookId: 2, bookName: "陶弘景", content: "御恶气暴风，毒肿流四肢疼痛。" },
                        { bookId: 3, bookName: "孙思邀", content: "治咳嗽胸胁支满，上气多唾者，每日温酒吞下七粒。" },
                        { bookId: 4, bookName: "《医学入门》", content: "利胸膈痰，止翻胃吐食，痰嗽上气，中风不语，面目色黄，安五脏，止夜多小便。又治扑损瘀血。" },
                        { bookId: 5, bookName: "《纲目》", content: "利气豁痰，除寒暖中，散肿止痛。治喘嗽反胃，痹木脚气，筋骨腰节诸痛。" }
                    ]
                },
                {
                    herbId: 4,
                    herbName: "车前子",
                    img: '../images/herbsImg/德阳/车前子.png',
                    functions: "为车前草科植物车前或平车前的干燥成熟种子。用于水肿胀满，热淋涩痛，暑湿泄泻，目赤肿痛，痰热咳嗽。",
                    mainFunc: "利水通淋，止泻，清肝明目，清肺化痰。用于水肿胀满，热淋涩痛，暑湿泄泻，目赤肿痛，痰热咳嗽。",
                    character: "车前种子略呈椭圆形或不规则长圆形，稍扁，长约2mm，宽约1mm。表面淡棕色或棕色，略粗糙不平。于扩大镜下可见微细纵纹，于稍平一面的中部有淡黄色凹点状种脐。质硬，切段面灰白色。种子放入水中，外皮有粘液释出。气微，嚼之带粘液性。以粒大、均匀饱满、色棕红者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主气癃、止痛，利水道小便，除湿痹。" },
                        { bookId: 2, bookName: "《本草经集注》", content: "主虚劳。" },
                        { bookId: 3, bookName: "《别录》", content: "男子伤中，女子淋沥，不欲食。养肺强阴益精。明目疗赤痛。" },
                        { bookId: 4, bookName: "《药性论》", content: "能去风毒，肝中风热，毒风冲眼目，赤痛障翳，脑痛泪出，去心胸烦热。" },
                        { bookId: 5, bookName: "《日华子本草》", content: "通小便淋涩，壮阳。治脱精，心烦。下气。" },
                        { bookId: 6, bookName: "《医学启源》", content: "主小便不通，导小肠中热。" }
                    ]
                },
                {
                    herbId: 5,
                    herbName: "鱼腥草",
                    img: '../images/herbsImg/德阳/鱼腥草.png',
                    functions: "为三白草科植物蕺菜的带根全草。主治肺炎，肺脓疡，热痢，疟疾，水肿，淋病，白带，痈肿，痔疮，脱肛，湿疹，秃疮，疥癣。",
                    mainFunc: "清热解毒，利尿消肿。治肺炎，肺脓疡，热痢，疟疾，水肿，淋病，白带，痈肿，痔疮，脱肛，湿疹，秃疮，疥癣。",
                    character: "干燥的全草极皱缩。茎扁圆柱形或类圆柱形，扭曲而细长，长约10～30厘米，粗约2～4毫米。表面淡红褐色至黄棕色，具纵皱纹或细沟纹，节明显可见，近下部的节上有须根痕迹残存。叶片极皱缩而卷折，上表面暗黄绿色至暗棕色，下表面青灰色或灰棕黄色。花穗少见。质稍脆，易碎，茎折断面不平坦而显粗纤维状。微具鱼腥气，新鲜者更为强烈；味微涩。以淡红褐色、茎叶完整、无泥土等杂质者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《别录》", content: "主蠼螋溺疮。" },
                        { bookId: 2, bookName: "《日华子本草》", content: "淡竹筒内煨，敷恶疮白秃。" },
                        { bookId: 3, bookName: "《履巉岩本草》", content: "大治中暑伏热闷乱，不省人事。" },
                        { bookId: 4, bookName: "《滇南本草》", content: "治肺痈咳嗽带脓血，痰有腥臭，大肠热毒，疗痔疮。" },
                        { bookId: 5, bookName: "《纲目》", content: "散热毒痈肿，疮痔脱肛，断痁疾，解硇毒。" }
                    ]
                }
            ]
        },
        {
            cityId: 7,
            cityName: "凉山",
            herbs: [
                {
                    herbId: 1,
                    herbName: "僵蚕",
                    img: '../images/herbsImg/凉山州/僵蚕.png',
                    functions: "为蚕蛾科昆虫家蚕蛾的幼虫感染白僵菌而僵死的干燥全虫。主治中风失音，惊痫，头风，喉风。喉痹，瘰疬结核。风疮瘾疹，丹毒，乳腺炎。",
                    mainFunc: "祛风解痉，化痰散结。治中风失音，惊痫，头风，喉风，喉痹，瘰疬结核，风疮瘾疹，丹毒，乳腺炎。",
                    character: "呈圆柱形，多弯曲而皱缩。长约2～5厘米，直径4～7毫米。表面灰白色或现浅棕色，多被有白色粉霜。头、足及各节均清晰可辨。体外常杂有丝团缠绕。头部黄褐色，类圆形。足8对，呈突起状。质硬而脆，易折断；断面平坦，色棕、黑不一，多光亮，外层为白色，显粉性，内有4个褐色的亮圈。微有腐臭气，味微咸。以条直肥壮，质坚，色白，断面光者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主小儿惊痫夜啼，去三虫，灭黑黚，男子阴瘍病。" },
                        { bookId: 2, bookName: "《别录》", content: "女子崩中赤白，产后余痛，灭诸疮瘢痕。未之，封疔肿，根当自出。" },
                        { bookId: 3, bookName: "《药性论》", content: "治口噤，发汗，主妇人崩中下血不止。" },
                        { bookId: 4, bookName: "《日华子本草》", content: "治中风失音，并一切风疾，小儿客忤，男子阴痒痛，女子带下。" },
                        { bookId: 5, bookName: "《本草图经》", content: "治中风，急喉痹，捣筛细末，生姜自然汁调灌之。" }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "附子",
                    img: '../images/herbsImg/凉山州/附子.png',
                    functions: "为毛茛科植物乌头（栽培品）的旁生块根（子根）。治阴盛格阳，大汗亡阳，吐利厥逆，心腹冷痛，脾泄冷痢，脚气水肿小儿慢惊，风寒湿痹，踒躄拘挛，阳萎，宫冷阴，疽疮漏及一切沉寒痼冷之疾。",
                    mainFunc: "回阳救逆，补火助阳，散寒除湿。治阴盛格阳，大汗亡阳，吐利厥逆，心腹冷痛，脾泄冷痢，脚气水肿小儿慢惊，风寒湿痹，踒躄拘挛，阳萎，宫冷阴，疽疮漏及一切沉寒痼冷之疾。",
                    character: "盐附子，呈圆锥形，长约5～8厘米，直径约3～4厘米。顶端宽大，中央有凹陷的芽痕，上身肥满，周围生有瘤状隆起的分支，习称钉角，表面灰黑色，被盐霜。体重，横切面灰褐色，具不整齐的筋脉或中心有小空隙，其中充满盐霜。无臭，味咸而麻辣。以个大、坚实、表面起盐霜者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《伤寒论》", content: "治吐利汗出，发热恶寒，四肢拘急，手足厥冷者：甘草二两（炙），干姜一两半，附子一枚（生用，去皮，破八片）。上三味，以水三升，煮取一升二合，去滓，分温再服。强人可大附子-枚，干姜三两。（《伤寒论》四逆汤）" },
                        { bookId: 2, bookName: "《传家秘宝方》", content: "治伤寒阴盛格阳，其人必躁热而不欲饮水者：大附子一枚烧为灰，存性，为末；蜜水调服。（《传家秘宝方》霹雳散）" },
                        { bookId: 3, bookName: "《济生方》", content: "治阴毒伤寒，面青，四肢厥逆，腹痛身冷，一切冷气：大附子三枚（炮裂，去皮脐）为末。每服三钱，姜汁半盏，冷酒半盏，调服。良久脐下如火暖为度。（《济生方》回阳散）" }
                    ]
                },
                {
                    herbId: 3,
                    herbName: "川楝子",
                    img: '../images/herbsImg/凉山州/川楝子.png',
                    functions: "本品为楝科植物川楝的干燥成熟果实。用于胸胁、脘腹胀痛，疝痛，虫积腹痛。",
                    mainFunc: "舒肝行气，止痛，驱虫。用于胸胁、脘腹胀痛，疝痛，虫积腹痛。",
                    character: "本品呈类球形，直径2～3.2cm。表面金黄色至棕黄色，微有光泽，少数凹陷或皱缩，具深棕色小点。顶端有花柱残痕，基部凹陷，有果梗痕。外果皮革质，与果肉间常成空隙，果肉松软，淡黄色，遇水润湿显黏性。果核球形或卵圆形，质坚硬，两端平截，有6～8条纵棱，内分6～8室，每室含黑棕色长圆形的种子1粒。气特异，味酸、苦。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主温疾、伤寒太热烦狂，杀三虫疥窃，利小便水道。" },
                        { bookId: 2, bookName: "《药性论》", content: "主人中大热，狂，失心躁闷，作汤浴。" },
                        { bookId: 3, bookName: "《珍珠囊》", content: "主上下部腹痛，心暴痛。" },
                        { bookId: 4, bookName: "《纲目》", content: "治诸疝、虫、痔。" },
                        { bookId: 5, bookName: "《医林纂要》", content: "泻心火，坚肾水，清肺金，清肝火。核：怡疝，去痼冷。" }
                    ]
                }
            ]
        },
        {
            cityId: 8,
            cityName: "绵阳",
            herbs: [
                {
                    herbId: 1,
                    herbName: "麦冬",
                    img: '../images/herbsImg/绵阳/麦冬.png',
                    functions: "为百合科植物麦冬的块根。主治肺燥干咳，吐血，咯血，肺痿，肺痈，虚劳烦热，消渴，热病津伤，咽干口燥，便秘。",
                    mainFunc: "养阴润肺，清心除烦，益胃生津。治肺燥干咳，吐血，咯血，肺痿，肺痈，虚劳烦热，消渴，热病津伤，咽干口燥，便秘。",
                    character: "本品呈纺锤形，两端略尖，长1.5～3cm，直径0.3～0.6cm。表面黄白色或淡黄色，有细纵纹。质柔韧，断面黄白色，半透明，中柱细小。气微香，味甘、微苦。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主心腹结气，伤中伤饱，胃络脉绝，羸瘦短气。" },
                        { bookId: 2, bookName: "《别录》", content: "疗身重目黄，心下支满，虚劳客热，口干燥渴，止呕吐，愈痿蹶，强阴益精，消谷调中，保神，定肺气，安五脏，令人肥健。" },
                        { bookId: 3, bookName: "《药性论》", content: "治热毒，止烦渴，主大水面目肢节浮肿，下水。治肺痿吐脓，主泄精。" },
                        { bookId: 4, bookName: "《本草拾遗》", content: "治寒热体劳，下痰饮。" },
                        { bookId: 5, bookName: "《日华子本草》", content: "治五劳七伤，安魂定魄，时疾热狂，头痛，止嗽。" }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "厚朴",
                    img: '../images/herbsImg/绵阳/厚朴.png',
                    functions: "本品为木兰科植物厚朴或凹叶厚朴的干燥干皮、根皮及枝皮。主治胸腹痞满胀痛，反胃，呕吐，宿食不消，痰饮喘咳，寒湿泻痢。",
                    mainFunc: "温中，下气，燥湿，消痰。治胸腹痞满胀痛，反胃，呕吐，宿食不消，痰饮喘咳，寒湿泻痢。",
                    character: "干皮呈卷筒状或双卷筒状，长30~35cm，厚2~7mm，习称筒朴；近根部的干皮一端展开如喇叭口，习称靴筒朴。外表面灰棕色或灰褐色，粗糙，栓皮呈鳞片状，较易剥落，有明显的椭圆形皮孔和纵皱纹，刮去栓皮者显黄棕色；内表面紫棕色或深紫褐色，具细密纵纹，划之显油痕。质坚硬，不易折断。断面颗粒性，外层灰棕色，内层紫褐色或棕色，有油性，有的可见多数小亮星。气香，味辛辣，微苦。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主中风伤寒，头痛，寒热惊悸，气血痹，死肌，去三虫。" },
                        { bookId: 2, bookName: "《别录》", content: "温中益气，消痰下气。疗霍乱及腹痛胀满，胃中冷逆及胸中呕不止，泄痢淋露，除惊，去留热心烦满，厚肠胃。" },
                        { bookId: 3, bookName: "《药性论》", content: "主疗积年冷气，腹内雷鸣，虚吼，宿食不消，除痰饮，去结水，破宿血，消化水谷，止痛。大温胃气，呕吐酸水。主心腹满，病人虚而尿白。" },
                        { bookId: 4, bookName: "《日华子本草》", content: "健脾。主反胃，霍乱转筋，冷热气，泻膀胱，泄五藏一切气，妇人产前产后腹藏不安。调关节，杀腹藏虫，明耳目。" }
                    ]
                },
                {
                    herbId: 3,
                    herbName: "辛夷",
                    img: '../images/herbsImg/绵阳/辛夷.png',
                    functions: "为木兰科植物望春玉兰、玉兰、武当玉兰等的干燥花蕾。治头痛，鼻渊，鼻塞不通，齿痛。",
                    mainFunc: "祛风，通窍。治头痛，鼻渊，鼻塞不通，齿痛。",
                    character: "花蕾长卵形，似毛笔头，长1.2~2.5cm，直径0.8~1.5cm，基部常具木质短梗，长约5mm，梗上有类白色点状皮孔。苞片2-3层，每层2片，两层苞片间有小鳞芽，苞片外表面密被灰白色或灰绿色长茸毛，内表面棕褐色，无毛。花被片9，3轮，棕褐色，外轮花被片条形，约为内两轮长的1／4，呈萼片状；雄蕊多数，螺旋状着生于花托下部，花丝扁平，花药线形；雌蕊多数，螺旋状着生于花托上部。体轻，质脆。气芳香，味辛凉而稍苦。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主五脏身体寒热，风头脑痛，面酐。" },
                        { bookId: 2, bookName: "《别录》", content: "温中解肌，利九窍，通鼻塞、涕出，治面肿引齿痛，眩冒、身几几如在车船之上者。生须发，去白虫。" },
                        { bookId: 3, bookName: "《药性论》", content: "能治面生酐。面脂用，主光华。" },
                        { bookId: 4, bookName: "《日华子本草》", content: "通关脉，明目。治头痛，憎寒、体噤、瘙痒。" },
                        { bookId: 5, bookName: "《滇南本草》", content: "治脑漏鼻渊，祛风，新瓦焙为末。治面寒痛，胃气痛，热洒服。" }
                    ]
                },
                {
                    herbId: 4,
                    herbName: "桔梗",
                    img: '../images/herbsImg/绵阳/桔梗.png',
                    functions: "为桔梗科植物桔梗的根。主治外感咳嗽，咽喉肿痛，肺痈吐脓，胸满胁痛，痢疾腹痛。",
                    mainFunc: "开宣肺气，祛痰排脓。治外感咳嗽，咽喉肿痛，肺痈吐脓，胸满胁痛，痢疾腹痛。",
                    character: "根圆柱形或纺锤形，下部渐细，有的分枝，长6~20cm，直径1~2cm。表面淡黄白色，微有光泽，皱缩，有扭曲的纵沟，并有横向皮孔玟痕及支根痕，有时可见未刮净的黄棕色或灰棕色栓皮；上端根茎（芦头）长0.5~4cm，直径约1cm，具半月形的茎痕，呈盘节状。质硬脆，易折断，折断面略不平坦，可见放射状裂隙，皮部类白色，形成层环棕色，木部淡黄色。气微，味微甜、苦。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主胸胁痛如刀刺，腹满，肠鸣幽幽，惊恐悸气。" },
                        { bookId: 2, bookName: "《别录》", content: "利五脏肠胃，补血气，除寒热、风痹，温中消谷，疗喉咽痛。" },
                        { bookId: 3, bookName: "《药性论》", content: "治下痢，破血，去积气，消积聚，痰涎，主肺热气促嗽逆，除腹中冷痛，主中恶及小儿惊痫。" },
                        { bookId: 4, bookName: "《日华子本草》", content: "下一切气，止霍乱转筋，心腹胀痛，补五劳，养气，除邪辟温，补虚消痰，破癥瘕，养血排脓，补内漏及喉痹。" },
                        { bookId: 5, bookName: "《本草衍义》", content: "治肺痈。" }
                    ]
                }
            ]
        },
        {
            cityId: 9,
            cityName: "南充",
            herbs: [
                {
                    herbId: 1,
                    herbName: "陈皮",
                    img: '../images/herbsImg/南充/陈皮.png',
                    functions: "本品为芸香科植物橘及其栽培变种的干燥成熟果皮。主治胸腹胀满，不思饮食，呕吐哕逆，咳嗽痰多。亦解鱼、蟹毒。",
                    mainFunc: "理气，调中，燥湿，化痰。治胸腹胀满，不思饮食，呕吐哕逆，咳嗽痰多。亦解鱼、蟹毒。",
                    character: "完整的果皮常剖成4瓣，每瓣多呈椭圆形，在果柄处连在一起。有时破碎分离，或呈不规则形的碎片状。片厚1～2毫米，通常向内眷曲：外表面鲜橙红色、黄棕色至棕褐色，有无数细小而凹入的油室；内表面淡黄白色，海绵状，并有短线状的维管束（橘络）痕，果蒂处较密。质柔软，干燥后质脆，易折断，断面不平。气芳香， 味苦。以皮薄、片大、色红、油润、香气浓者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主胸中瘕热、逆气，利水谷，久服去臭，下气。" },
                        { bookId: 2, bookName: "《别录》", content: "下气，止呕咳，除膀胱留热、停水、五琳，利小便，主脾不能消谷，气冲胸中，吐逆霍乱，止泄，去寸白。" },
                        { bookId: 3, bookName: "《药性论》", content: "治胸膈间气，开胃，主气痢，消痰涎，治上气咳嗽。" },
                        { bookId: 4, bookName: "《本草拾遗》", content: "去气，调中。" },
                        { bookId: 5, bookName: "《日华子本草》", content: "消痰止嗽，破癥瘕痃癣。" },
                        { bookId: 6, bookName: "《医学启源》", content: "去胸中寒邪，破滞气，益脾胃。" }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "薄荷",
                    img: '../images/herbsImg/南充/薄荷.png',
                    functions: "本品为唇形科薄荷属植物薄荷的干燥地上部分。用于风热感冒，风温初起，头痛，目赤，喉痹，口疮，风疹，麻疹，胸胁胀闷。",
                    mainFunc: "宣散风热。清头目，透疹。用于风热感冒，风温初起，头痛，目赤，喉痹，口疮，风疹，麻疹，胸胁胀闷。",
                    character: "干燥全草，茎方柱形，长15～35厘米，直径2～4毫米，黄褐色带紫，或绿色，有节，节间长3～7厘米，上部有对生分枝，表面被白色绒毛，角棱处较密，质 脆，易折断，断面类白色，中空。叶对生，叶片卷曲面皱缩，多破碎。上面深绿色，下面浅绿色。具有白色绒毛；质脆。枝顶常有轮伞花序，黄棕色，花冠多数存 在。气香，味辛凉。以身干、无根、叶多、色绿、气味浓者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《药性论》", content: "新病瘥人勿食，令人虚汗不止。" },
                        { bookId: 2, bookName: "《千金·食治》", content: "动消渴病。" },
                        { bookId: 3, bookName: "《本经逢原》", content: "多服久服，令人虚冷；阴虚发热，咳嗽自汗者勿施。" },
                        { bookId: 4, bookName: "《本草从新》", content: "辛香伐气，多服损肺伤心，虚者远之。" }
                    ]
                },
                {
                    herbId: 3,
                    herbName: "金钱草",
                    img: '../images/herbsImg/南充/金钱草.png',
                    functions: "本品为报春花科植物过路黄的干燥全草。主治黄疸，水肿，膀胱结石，疟疾，肺痈，咳嗽，吐血，淋浊，带下，风湿痹痛，小儿疳积，惊痫，痈肿，疮癣，湿疹。",
                    mainFunc: "清热解毒，利尿通淋，除湿退黄，散瘀消肿。治黄疸，水肿，膀胱结石，疟疾，肺痈，咳嗽，吐血，淋浊，带下，风湿痹痛，小儿疳积，惊痫，痈肿，疮癣，湿疹。",
                    character: "本品常缠结成团，无毛或被疏柔毛。茎扭曲，表面棕色或暗棕红色，有纵纹，下部茎节上有时具须根，断面实心。叶对生，多皱缩，展平后呈宽卵形或心形，长1～4cm，宽1～5cm，基部微凹，全缘；上表面灰绿色或棕褐色，下表面色较浅，主脉明显突起，用水浸后，对光透视可见黑色或褐色条纹；叶柄长 1～4cm。有的带花，花黄色，单生叶腋，具长梗。蒴果球形。气微，味淡。",
                    literature: [
                        { bookId: 1, bookName: "《百草镜》", content: "治跌打损伤，疟疾，产后惊风，肚痈，便毒，痔漏；擦鹅掌风；汁漱牙疼。" },
                        { bookId: 2, bookName: "王安卿《采药志》", content: "发散头风风邪。治脑漏，白浊热淋，玉茎肿痛，捣汁冲酒吃。" },
                        { bookId: 3, bookName: "《纲目拾遗》", content: "去风散毒。煎汤洗一切疮疥。" },
                        { bookId: 4, bookName: "《本草求原》", content: "祛风湿，止骨痛。浸酒舒筋活络，止跌打闪伤（痛），取汁调酒更效。" },
                        { bookId: 5, bookName: "《植物名实图考》", content: "治吐血、下血。" }
                    ]
                },
                {
                    herbId: 4,
                    herbName: "骨碎补",
                    img: '../images/herbsImg/南充/骨碎补.png',
                    functions: "本品为水龙骨科植物槲蕨的干燥根茎。主治肾虚久泻及腰痛，风湿痹痛，齿痛，耳鸣，跌打闪挫、骨伤，阑尾炎，斑秃，鸡眼。",
                    mainFunc: "补肾强骨，活血止痛。治肾虚久泻及腰痛，风湿痹痛，齿痛，耳鸣，跌打闪挫、骨伤，阑尾炎，斑秃，鸡眼。",
                    character: "本品呈扁平长条状，多弯曲，有分枝，长5～15cm，宽1～1.5cm，厚0.2～0.5cm。表面密被深棕色至暗棕色的小鳞片，柔软如毛，经火燎者呈棕褐色或暗褐色，两侧及上表面均具凸起或凹下的圆形叶痕，少数有叶柄残基及须根残留。体轻，质脆，易折断，断面红棕色，维管束呈黄色点状，排列成环。无臭，味 淡，微涩。",
                    literature: [
                        { bookId: 1, bookName: "《药性论》", content: "主骨中毒气，风血疼痛，五劳六极，口（一作’足’）手不收，上热下冷。" },
                        { bookId: 2, bookName: "《日华子本草》", content: "治恶疮，蚀烂肉，杀虫。" },
                        { bookId: 3, bookName: "《开宝本草》", content: "主破血，止血，补伤折。" },
                        { bookId: 4, bookName: "《本草正》", content: "疗骨中邪毒，风热疼痛，或外感风湿，以致两足痿弱疼痛。" }
                    ]
                }
            ]
        },
        {
            cityId: 10,
            cityName: "雅安",
            herbs: [
                {
                    herbId: 1,
                    herbName: "黄柏",
                    img: '../images/herbsImg/雅安/黄柏.png',
                    functions: "本品为芸香科植物黄柏或黄皮树的干燥树皮。主治热痢，泄泻，消渴，黄疸，痿躄，梦遗，淋浊，痔疮，便血，亦白带下，骨蒸劳热，目赤肿痛，口舌生疮，疮疡肿毒。",
                    mainFunc: "清热。燥湿，泻火，解毒。治热痢，泄泻，消渴，黄疸，痿躄，梦遗，淋浊，痔疮，便血，亦白带下，骨蒸劳热，目赤肿痛，口舌生疮，疮疡肿毒。",
                    character: "为植物黄皮树及其变型变种的干燥树皮。呈稍弯曲的板片状，边缘不整齐，长宽不一，厚约3～5毫米，栓皮多已剥离。外表面深黄色，较平坦，有纵棱线及棕色皮孔；内表面灰黄色或黄色。质坚硬而轻，易折断，折断面纤维性，呈片状分裂，鲜黄色。气微，味苦，嚼之有粘滑性，能使水染黄色。以片张厚大、鲜黄色、无栓皮者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主五脏肠胃中结热，黄疸，肠痔；止泄痢，女子漏下赤白，阴伤蚀疮。" },
                        { bookId: 2, bookName: "《别录》", content: "疗惊气在皮间，肌肤热赤起，目热赤痛，口疮。" },
                        { bookId: 3, bookName: "《药性论》", content: "主男子阴痿。治下血如鸡鸭肝片；及男子茎上疮，屑末敷之。" },
                        { bookId: 4, bookName: "《本草拾遗》", content: "主热疮疱起，虫疮，痢，下血，杀蛀虫；煎服，主消渴。" },
                        { bookId: 5, bookName: "《日华子本草》", content: "安心除劳，治骨蒸，洗肝，明目，多泪，口干，心热，杀疳虫，治蛔心痛，疥癣，蜜炙治鼻洪，肠风，泻血，后分急热肿痛。" }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "乌梅",
                    img: '../images/herbsImg/雅安/乌梅.png',
                    functions: "为蔷薇科植物梅的干燥未成熟果实。治久咳，虚热烦渴，久疟，久泻，痢疾，便血，尿血，血崩，蛔厥腹痛、呕吐，钩虫病，牛皮癣，胬肉。",
                    mainFunc: "敛肺止咳，涩肠止泻，止血，生津，安蛔。治久咳，虚热烦渴，久疟，久泻，痢疾，便血，尿血，血崩，蛔厥腹痛、呕吐，钩虫病，牛皮癣，胬肉。",
                    character: "干燥果实呈扁圆形或不规则球形，直径1.5～3厘米。表面棕黑色至乌黑色，皱缩、凹凸不平。有的外皮已破碎，核露于外。果实一端有明显的凹陷（即果柄脱落处），果肉质柔软。核坚硬，棕黄色，内含淡黄色种仁1粒，形状及气味极似杏仁。气特异，味极酸。以个大、肉厚、核小、外皮乌黑色、不破裂露核、柔润、味极酸者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主下气，除热烦满，安心，肢体痛，偏枯不仁，死肌，去青黑痣、恶肉。" },
                        { bookId: 2, bookName: "《别录》", content: "止下痢，好唾口干。利筋脉，去痹。" },
                        { bookId: 3, bookName: "陶弘景", content: "伤寒烦热，水渍饮汁。" },
                        { bookId: 4, bookName: "孟诜", content: "大便不通，气奔欲死，以乌梅十颗，置汤中，须臾挼去核，杵为丸如枣大，纳下部，少时即通。擘破水渍，以少蜜相和，止渴。霍乱心腹不安，及痢赤、治疟方多用之。" },
                        { bookId: 5, bookName: "《本草拾遗》", content: "去痰，主疟瘴，止渴调中，除冷热痢，止吐逆。" }
                    ]
                },
                {
                    herbId: 3,
                    herbName: "花椒",
                    img: '../images/herbsImg/雅安/花椒.png',
                    functions: "为芸香科植物花椒的果皮。主治积食停饮，心腹冷痛，呕吐，噫呃，咳嗽气逆，风寒湿痹，泄泻，痢疾，疝痛，齿痛，蛔虫病，蛲虫病，阴痒，疮疥。",
                    mainFunc: "温中散寒，除湿，止痛，杀虫，解鱼腥毒。治积食停饮，心腹冷痛，呕吐，噫呃，咳嗽气逆，风寒湿痹，泄泻，痢疾，疝痛，齿痛，蛔虫病，蛲虫病，阴痒，疮疥。",
                    character: "花椒由1-2，偶由3-4个球形分果组成，每一分果直径4.5-5mm，自先端沿腹缝线或腹背缝线开裂，常呈基部相连的两瓣状。分果顶端具微细小喙，基部大多具1-2个颗粒状未发育离生心皮，直径1-2mm。外表面深红色、紫红色或棕红色，皱缩，有众多点状凸起的油点。内果皮光滑，淡黄色，薄革质，与中果皮部分分离而卷曲。果柄直径约0.8mm，被稀疏短毛。果皮革质，稍韧，有特异香气，味持久麻辣。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主风邪气，温中，除寒痹，坚齿发，明目。主邪气咳逆，温中，逐骨节皮肤死肌，寒湿痹痛，下气。" },
                        { bookId: 2, bookName: "《别录》", content: "疗喉痹，吐逆，疝瘕，去老血，产后余疾腹痛，出汗，利五脏。除六腑寒冷，伤寒，温疟，大风汗不出，心腹留饮，宿食，肠游下痢，泄精，女子字乳余疾，散风邪瘕结，水肿，黄疸，杀虫鱼毒。开腠理，通血脉，坚齿发，调关节，耐寒暑，可作膏药。" },
                        { bookId: 3, bookName: "《药性论》", content: "治恶风，遍身四肢顽痹，口齿浮肿摇动；主女人月闭不通，治产后恶血痢，多年痢，主生发，疗腹中冷痛。治头风下泪，腰脚不遂，虚损留结，破血，下诸石水，腹内冷而痛，除齿痛。" },
                        { bookId: 4, bookName: "《食疗本草》", content: "灭瘢，下乳汁。" }
                    ]
                },
                {
                    herbId: 4,
                    herbName: "白术",
                    img: '../images/herbsImg/雅安/白术.png',
                    functions: "本品为菊科植物白术的干燥根茎。治脾胃气弱，不思饮食，倦怠少气，虚胀，泄泻，痰饮，水肿，黄疸，湿痹，小便不利，头晕，自汗，胎气不安。",
                    mainFunc: "补脾，益胃，燥湿，和中，安胎。治脾胃气弱，不思饮食，倦怠少气，虚胀，泄泻，痰饮，水肿，黄疸，湿痹，小便不利，头晕，自汗，胎气不安。",
                    character: "根茎规则的肥厚团块，长3~13cm，直径1.5~7cm。表面灰黄构或灰棕色，有瘤状突起及断续的纵皱和沟纹，并有须根痕，顶端有殖留茎基和芽痕。质坚 硬，不易折断；断面不平坦，黄白色至淡棕色，有棕黄色的点状油室散在，烘干者断面角质样，色较深或有裂隙。气清香，味甘、微辛，嚼之略带粘性。以个大、质坚实、断面黄白色、香气浓者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主风寒湿痹，死肌，痉，疸，止汗，除热消食。" },
                        { bookId: 2, bookName: "《别录》", content: "主大风在身面，风眩头痛，目泪出，消痰水，逐皮间风水结肿，除心下急满，及霍乱吐下不止，利腰脐间血，益津液，暖胃，消谷嗜食。" },
                        { bookId: 3, bookName: "《药性论》", content: "主大风顽痹，多年气痢，心腹胀痛，破消宿食，开胃，去痰诞，除寒热，止下泄，主面光悦，驻颜去皯，治水肿胀满，止呕逆，腹内冷痛，吐泻不住，及胃气虚冷痢。" },
                        { bookId: 4, bookName: "《唐本草》", content: "利小便。" }
                    ]
                }
            ]
        },
        {
            cityId: 11,
            cityName: "攀枝花",
            herbs: [
                {
                    herbId: 1,
                    herbName: "何首乌",
                    img: '../images/herbsImg/攀枝花/何首乌.png',
                    functions: "本品为蓼科植物何首乌的干燥块根，其藤茎称夜交藤。治肝肾阴亏，发须早白，血虚头晕，腰膝软弱，筋骨酸痛，遗精，崩带，久疟，久痢，慢性肝炎，痈肿，瘰疬，肠风，痔疾。",
                    mainFunc: "补肝，益肾，养血，祛风。治肝肾阴亏，发须早白，血虚头晕，腰膝软弱，筋骨酸痛，遗精，崩带，久疟，久痢，慢性肝炎，痈肿，瘰疬，肠风，痔疾。制首乌补肝肾，益精血，乌须发，壮筋骨；用于眩晕耳鸣、须发早白、腰膝酸软、肢体麻木、神经衰弱、高血脂症。",
                    character: "本品呈团块状或不规则纺锤形，长6～15cm，直径4～12cm。表面红棕色或红褐色，皱缩不平，有浅沟，并有横长皮孔及细根痕。体重，质坚实，不 易折断，断面浅黄棕色或浅红棕色，显粉性，皮部有4～11个类圆形异型维管束环列，形成云锦状花纹，中央木部较大，有的呈木心。气微，味微苦而甘涩。",
                    literature: [
                        { bookId: 1, bookName: "《何首乌录》", content: "主五痔，腰腹中宿疾冷气，长筋益精，能食，益气力，长肤，延年。" },
                        { bookId: 2, bookName: "《日华子本草》", content: "治一切冷气及肠风。" },
                        { bookId: 3, bookName: "《开宝本草》", content: "主瘰疬，消痈肿，疗头面风疮，五痔，止心痛，益血气，黑髭鬓，悦颜色，亦治妇人产后及带下诸疾。" },
                        { bookId: 4, bookName: "王好古", content: "泻肝风。" },
                        { bookId: 5, bookName: "《滇南本草》", content: "涩精，坚肾气，止赤白便浊，缩小便，入血分，消痰毒。治办白癜风，疮疥顽癣，皮肤瘙庠。截疟，治痰疟。" }
                    ]
                }
            ]
        },
        {
            cityId: 12,
            cityName: "乐山",
            herbs: [
                {
                    herbId: 1,
                    herbName: "郁金",
                    img: '../images/herbsImg/乐山/郁金.png',
                    functions: "为姜科植物温郁金、姜黄、广西莪术、莪术或川郁金的块根。治胸腹胁肋诸痛，失心癫狂，热病神昏，吐血，衄血，尿血，血淋，妇女倒经，黄疸。",
                    mainFunc: "行气解郁，活血止痛，利胆退黄。治胸腹胁肋诸痛，失心癫狂，热病神昏，吐血，衄血，尿血，血淋，妇女倒经，黄疸。",
                    character: "黄丝郁金、广玉金。为植物姜黄的干燥块根，呈卵圆形或长卵圆形，两端稍尖，中部微满，长2～4厘米，中部直径1～2厘米。表面灰黄色或淡棕色，有灰白色细皱纹及凹下的小点，一端显折断的痕迹，呈鲜黄色，另一端稍尖。质坚实，横断面平坦光亮，呈角质状，杏黄色或橙黄色，中部有一颜色较浅的圆心。微有姜香气，味辛而苦。以个大、肥满、外皮皱纹细、断面橙黄色者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《药性论》", content: "治女人宿血气心痛，冷气结聚，温醋摩服之。" },
                        { bookId: 2, bookName: "《唐本草》", content: "主血积，下气，生肌，止血，破恶血，血淋，尿血，金疮。" },
                        { bookId: 3, bookName: "《珍珠囊》", content: "凉心。" },
                        { bookId: 4, bookName: "李杲", content: "治阳毒入胃，下血频痛。" },
                        { bookId: 5, bookName: "《本草衍义补遗》", content: "治郁遏不能散。" }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "佛手",
                    img: '../images/herbsImg/乐山/佛手.png',
                    functions: "本品为芸香科柑橘属植物佛手的干燥果实。主治胃痛，胁胀，呕吐，噎膈，痰饮咳喘，并能解酒。",
                    mainFunc: "疏肝理气，和胃，化痰。治胃痛，胁胀，呕吐，噎膈，痰饮咳喘，并能解酒。",
                    character: "下部圆形，近柄处略窄，有残留果柄或柄痕。上部分枝，为圆柱形，如手指状，屈伸不一，长短参差，一般长12～16厘米，顶端稍尖或扭曲，外皮橙黄色或绿褐色，有纵横不整的深皱，及稀疏的疣状突起，较平坦的地方可见到细密的窝点，皮厚1.5～4毫米许，内面果肉类白色或黄白色，中心有两条纵行筋络状条纹，直达顶端，质较软而韧，气芳香，味酸苦。",
                    literature: [
                        { bookId: 1, bookName: "《滇南本草》", content: "补肝暖胃，止呕吐，消胃寒痰，治胃气疼痛。止面寒疼，和中行气。" },
                        { bookId: 2, bookName: "《纲目》", content: "煮酒饮，治痰气咳嗽。煎汤，治心下气痛。" },
                        { bookId: 3, bookName: "《本经逢原》", content: "专破滞气。治痢下后重，取陈年者用之。" },
                        { bookId: 4, bookName: "《本草再新》", content: "治气舒肝，和胃化痰，破积，治噎膈反胃，消癥瘕瘰疬。" },
                        { bookId: 5, bookName: "《随息居饮食谱》", content: "醒胃豁痰，辟恶，解酲，消食止痛。" }
                    ]
                },
                {
                    herbId: 3,
                    herbName: "黄连",
                    img: '../images/herbsImg/乐山/黄连.png',
                    functions: "本品为毛茛科植物黄连、三角叶黄连或云连的干燥根茎。主治时行热毒，伤寒，热盛心烦，痞满呕逆，菌痢，热泻腹痛，肺结按，吐、衄、下血，消渴，疳积，蛔虫病，百日咳，咽喉肿痛，火眼，口疮，痈疽疮毒，湿疹，汤火烫伤。",
                    mainFunc: "泻火，燥湿，解毒，杀虫。治时行热毒，伤寒，热盛心烦，痞满呕逆，菌痢，热泻腹痛，肺结按，吐、衄、下血，消渴，疳积，蛔虫病，百日咳，咽喉肿痛，火眼，口疮，痈疽疮毒，湿疹，汤火烫伤。",
                    character: "多集聚成簇，常弯曲，形如鸡爪，单枝根茎长3～6cm，直径0.3～0.8cm。表面灰黄色或黄褐色，粗糙，有不规则结节状隆起、须根及须根残基，有的节间表面平滑如茎杆，习称过桥。上部多残留褐色鳞叶，顶端常留有残余的茎或叶柄。质硬，断面不整齐，皮部橙红色或暗棕色，木部鲜黄色或橙黄色，呈放射状排列，髓部有的中空。气微，味极苦。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主热气目痛，眦伤泣出，明目，肠辩腹痛下痢，妇人阴中肿痛。" },
                        { bookId: 2, bookName: "《本草经集注》", content: "解巴豆毒。" },
                        { bookId: 3, bookName: "《别录》", content: "主五脏冷热，久下泄辩脓血，止消渴，大惊，除水利骨，调胃厚肠，益胆，疗口疮。" },
                        { bookId: 4, bookName: "《药性论》", content: "杀小儿疳虫，点赤眼昏痛，镇肝去热毒。" },
                        { bookId: 5, bookName: "《本草拾遗》", content: "主羸瘦气急。" }
                    ]
                },
                {
                    herbId: 4,
                    herbName: "生姜",
                    img: '../images/herbsImg/乐山/生姜.png',
                    functions: "为姜科植物姜的新鲜根茎。主治感冒风寒，呕吐，痰饮，喘咳，胀满，泄泻；解半夏、天南星及鱼蟹、鸟兽肉毒。",
                    mainFunc: "发表，散寒，止呕，开痰。治感冒风寒，呕吐，痰饮，喘咳，胀满，泄泻；解半夏、天南星及鱼蟹、鸟兽肉毒。",
                    character: "根茎呈不规则块状，略扁，具指状分枝，长4~18cm，厚1~3cm。表面黄褐色或灰棕色，有环节，分枝顶端有茎痕或芽。质脆，晚折断，断面浅黄色，内皮层环纹明显，维管束散在。气香，特异味辛辣。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "去臭气，通神明。" },
                        { bookId: 2, bookName: "《别录》", content: "主伤寒头痛鼻塞，咳逆上气。" },
                        { bookId: 3, bookName: "陶弘景", content: "归五脏，去痰下气，止呕吐，除风湿寒热。" },
                        { bookId: 4, bookName: "《药性论》", content: "主痰水气满，下气；生与干并治嗽，疗时疾，止呕吐不下食。生和半夏主心下急痛；若中热不能食，捣汁和蜜服之。又汁和杏仁作煎，下一切结气实，心胸拥隔，冷热气。" },
                        { bookId: 5, bookName: "《千金·食治》", content: "通汗，去膈上臭气。" }
                    ]
                },
                {
                    herbId: 5,
                    herbName: "重楼",
                    img: '../images/herbsImg/乐山/重楼.png',
                    functions: "为百合科植物七叶一枝花、金线重楼及其数种同属植物的根茎。主治痈肿，疔疮，瘰疬，喉痹，慢性气管炎，小儿惊风抽搐，蛇虫咬伤。",
                    mainFunc: "清热解毒，平喘止咳，熄风定惊。治痈肿，疔疮，瘰疬，喉痹，慢性气管炎，小儿惊风抽搐，蛇虫咬伤。",
                    character: "本品呈结节状扁圆柱形，略弯曲，长5～12cm，直径1.0～4.5cm。表面黄棕色或灰棕色，外皮脱落处呈白色； 密具层状凸起的粗环纹，一面结节明显，结节上具椭圆形凹陷茎痕，另一面有疏生的须根或疣状须根痕。顶端具鳞叶及茎的残基。质坚实，断面平坦，白色至浅棕 色，粉性或角质。无臭，味微苦、麻。",
                    literature: [
                        { bookId: 1, bookName: "《本经》", content: "主惊痫，摇头弄舌，热气在腹中，癫疾，痈疮，阴蚀，下三虫，去蛇毒。" },
                        { bookId: 2, bookName: "《唐本草》", content: "醋摩疗痈肿，敷蛇毒。" },
                        { bookId: 3, bookName: "《日华子本草》", content: "治胎风搐手足，能吐泻瘰疬。" },
                        { bookId: 4, bookName: "《滇南本草》", content: "消诸疮，无名肿毒，利小便。" },
                        { bookId: 5, bookName: "《纲目》", content: "去疟疾寒热。" }
                    ]
                }
            ]
        },
        {
            cityId: 13,
            cityName: "宜宾",
            herbs: [
                {
                    herbId: 1,
                    herbName: "仙茅",
                    img: '../images/herbsImg/宜宾/仙茅.png',
                    functions: "本品为石蒜科植物仙茅的干燥根茎。治阳萎精冷，小便失禁，崩漏，心腹冷痛，腰脚冷痹，痈疽，瘰疬，阳虚冷泻。",
                    mainFunc: "温肾阳，壮筋骨。治阳萎精冷，小便失禁，崩漏，心腹冷痛，腰脚冷痹，痈疽，瘰疬，阳虚冷泻。",
                    character: "干燥根茎为圆柱形，略弯曲，两端平，长3～10厘米，直径3～8毫米。表面棕褐色或黑褐色，粗糙，皱缩不平，有细密而不连续的横纹，并散布有不甚明显的细小圆点状皮孔。未去须根者，在根茎的一端常丛生两端细、中间粗的须根，长约3～6厘米，有极密的环状横纹，质轻而疏松，柔软而不易折断。根茎质坚脆，易折断，断面平坦，微带颗粒性（经蒸过者略呈透明角质状），皮部浅灰棕色或因糊化而呈红棕色，靠近中心处色较深。微有辛香气，味微苦辛。以根条粗长、质坚脆、表面黑褐色者为佳。",
                    literature: [
                        { bookId: 1, bookName: "《海药本草》", content: "主风，补暖腰脚，清安五脏，强筋骨，消食。宣而复补，主丈夫七伤，明耳目，益筋力，填骨髓，益阳。" },
                        { bookId: 2, bookName: "《日华子本草》", content: "治一切风气，补五劳七伤，开胃下气。" },
                        { bookId: 3, bookName: "《开宝本草》", content: "主心腹冷气不能食，腰脚风冷挛痹不能行，丈夫虚劳，老人失溺。" },
                        { bookId: 4, bookName: "《滇南本草》", content: "治妇人红崩下血，攻痈疽，排脓。" },
                        { bookId: 5, bookName: "《生草药性备要》", content: "补肾，止痛，治白浊，理痰火，煲肉食。十蒸九晒，用沙糖藏好，早晨茶送，能壮精神，乌须发。" }
                    ]
                },
                {
                    herbId: 2,
                    herbName: "黄精",
                    img: '../images/herbsImg/宜宾/黄精.png',
                    functions: "为百合科植物黄精、囊丝黄精、热河黄精、滇黄精、卷叶黄精等的根茎。治阴虚劳嗽，肺燥咳嗽，脾虚乏力，食少口干，消渴，肾亏腰膝酸软，阳痿遗精，耳鸣目暗，须发早白，体虚赢瘦，风癞癣疾。",
                    mainFunc: "养阴润肺，补脾益气，滋肾填精。主阴虚劳嗽，肺燥咳嗽，脾虚乏力，食少口干，消渴，肾亏腰膝酸软，阳痿遗精，耳鸣目暗，须发早白，体虚赢瘦，风癞癣疾。",
                    character: "呈肥厚肉质的结节块状，结节长可达10cm以上，宽3～6cm，厚2～3cm。表面淡黄色至黄棕色，具环节，有皱纹及须根痕，结节上侧茎痕呈圆盘状，圆周凹入，中部突出。质硬而韧，不易折断，断面角质，淡黄色至黄棕色。气微，味甜，嚼之有黏性。",
                    literature: [
                        { bookId: 1, bookName: "《别录》", content: "主补中益气，除风湿，安五脏。" },
                        { bookId: 2, bookName: "《日华子本草》", content: "补五劳七伤，助筋骨，止饥，耐寒暑，益脾胃，润心肺。" },
                        { bookId: 3, bookName: "《滇南本草》", content: "补虚添精。" },
                        { bookId: 4, bookName: "《纲目》", content: "补诸虚，止寒热，填精髓，下三尸虫。" },
                        { bookId: 5, bookName: "《本草从新》", content: "平补气血而润。" }
                    ]
                }
            ]
        }
    ]
};





let panels = document.querySelectorAll('.panels')
let frames = document.querySelectorAll('.frameDiv')
function getDivPanel() {
    catalogueItems = document.querySelectorAll('.catalogue .all-div');
    // 获取yellow_bg盒子
    yellowBgDiv = document.querySelector('.yellow_bg')
    yellowBgName = document.querySelector('.yellow_bg .name')
    yellowBgContent = document.querySelector('.yellow_bg .content')

    mainWin = document.querySelector('.manyWindows')
    homeJumpDiv = document.querySelector('.homeJump')
    panels = document.querySelectorAll('.panel')
    frames = document.querySelectorAll('.frameDiv')
}
function getUrlParam() {
    // 从localStorage获取id
    const id = localStorage.getItem('pathId');
    // 如果需要，可以在页面上显示id
    // document.querySelector('h1').innerText = id;
    return id;
}

function changeProvinceName(id) {
    const name = document.querySelector('.province h1')
    name.innerHTML = `${id}`
}

function returnIndex() {
    const index = document.querySelector('.province')
    index.addEventListener('click', () => {
        window.location.href = `../index.html`
    })
}

//得到特定城市对象
function getAloneData(id) {
    return datas.citys.find(e => e.cityName === id)
}

// console.log(getAloneData('成都'));
//得到特定城市对象大小

function createLit(nowCity, nowHerbId) {//根据文献数量，创建百叶窗数目
    const eNum = nowCity.herbs[nowHerbId].literature.length
    for (let i = 0; i < eNum; i++) {
        // console.log(444);
        mainWin.appendChild(document.createElement('div'))
    }
    const panels = document.querySelectorAll('.manyWindows div')
    // console.log(panels);
    panels.forEach(e => {
        e.classList.add('panel')
    });

}


//根据草药数量，创建草药盒子
function createHerbs(nowCity) {
    // console.log(nowCity);
    const eNum = nowCity.herbs.length - 1
    // console.log(eNum);
    for (let i = 0; i < eNum; i++) {
        homeJumpDiv.appendChild(document.createElement('div'))
    }
    const frames = document.querySelectorAll('.homeJump div')
    frames.forEach((e, key) => {
        e.classList.add('frameDiv')
        e.id = `${key}`
        // console.log(key);
    })
}


//渲染草药名字
function addHerbsName(nowCity) {
    const eNum = nowCity.herbs.length

    for (let i = 0; i < eNum; i++) {
        const name = nowCity.herbs[i].herbName

        const frames = document.querySelectorAll('.homeJump .frameDiv')
        // console.log(frames);
        frames[i].innerHTML = name
    }
}

//通过now得到草药id
function getHerbId() {
    let id = "0"
    frames.forEach(e => {
        if (e.classList.contains('now')) {
            id = e.id
        }
    })
    return id
}

// 为每个目录项添加点击事件监听器
//渲染目录
function addcatalog(id) {
    catalogueItems.forEach(item => {
        const listener = () => updateFuncMainLite(item, id);
        item.addEventListener('click', listener);
        listenersMap.set(item, listener);
    });
}

function removeCatalogListeners() {
    // yellowBgContent.innerHTML=''
    catalogueItems.forEach(item => {
        // 从Map中获取之前存储的事件监听器
        const listener = listenersMap.get(item);
        if (listener) {
            // 移除事件监听器
            item.removeEventListener('click', listener);
            // 从Map中移除该项
            listenersMap.delete(item);
        }
    });
    panels.forEach(panel => {
        // 从Map中获取之前存储的事件监听器
        const listener = listenersMap.get(panel);
        if (listener) {
            // 使用之前存储的函数引用来移除事件监听器
            panel.removeEventListener('click', listener);
            // 从Map中移除这个panel的映射关系，以避免内存泄漏
            listenersMap.delete(panel);
        }
    });
}

function updateFuncMainLite(item, id) {
    // console.log(e);
    // console.log(222);
    const nowHerbId = getHerbId()
    const currentCity = getAloneData(`${id}`)
    // console.log(currentCity);
    // 检查当前点击的项是否已经激活
    const isActive = item.classList.contains('active');
    // console.log(isActive);
    // 首先移除所有项的active类
    catalogueItems.forEach(item => item.classList.remove('active'));
    // console.log(catalogueItems);
    // 如果当前项未激活或者没有项激活，则激活当前项
    if (!isActive) {
        item.classList.add('active');
        // console.log(item);
        // 如果点击的不是literature类，显示yellow_bg盒子
        if (!item.classList.contains('literature')) {
            yellowBgDiv.style.opacity = 1
            yellowBgDiv.style.visibility = 'visible'
            mainWin.style.opacity = 0
            mainWin.style.visibility = 'hidden'
            // 根据内容调整yellow_bg盒子的大小（这里需要你自己实现getContentSize函数）
            // const contentSize = getContentSize( item);
            // yellowBgDiv.style.width = contentSize.width + 'px';
            // yellowBgDiv.style.height = contentSize.height + 'px';
            if (item.id === '1') {
                yellowBgDiv.style.opacity = 0
                setTimeout(() => {
                    let size = currentCity.herbs[nowHerbId].functions
                    yellowBgName.innerHTML = '功效'
                    yellowBgContent.innerHTML = currentCity.herbs[nowHerbId].functions
                    let fa = changeBigSize(yellowBgDiv, size.length)
                    // console.log(fa);
                    changeSmallSize(yellowBgContent, fa)
                    yellowBgDiv.style.opacity = 1
                }, 100);

            } else if (item.id === '2') {
                yellowBgDiv.style.opacity = 0
                setTimeout(() => {
                    let size = currentCity.herbs[nowHerbId].mainFunc
                    yellowBgName.innerHTML = '主治'
                    yellowBgContent.innerHTML = currentCity.herbs[nowHerbId].mainFunc
                    let fa = changeBigSize(yellowBgDiv, size.length)
                    changeSmallSize(yellowBgContent, fa)
                    yellowBgDiv.style.opacity = 1
                }, 100);
            } else if (item.id === '3') {
                yellowBgDiv.style.opacity = 0
                setTimeout(() => {
                    let size = currentCity.herbs[nowHerbId].character
                    yellowBgName.innerHTML = '性状'
                    yellowBgContent.innerHTML = currentCity.herbs[nowHerbId].character
                    let fa = changeBigSize(yellowBgDiv, size.length)
                    changeSmallSize(yellowBgContent, fa)
                    yellowBgDiv.style.opacity = 1
                }, 100);

            }
            removeActiveClass()
        } else {
            mainWin.style.opacity = 1
            mainWin.style.visibility = 'visible'
            yellowBgDiv.style.visibility = 'hidden'
            yellowBgDiv.style.opacity = 0
            // console.log(panels.length);
            // let panels = document.querySelectorAll('.manyWindows .panel')
            for (let i = 0; i < panels.length; i++) {
                panels[i].innerHTML = `<h2>${currentCity.herbs[nowHerbId].literature[i].bookName}</h2>
                <div class="vertical"></div>`
                // +currentCity.herbs[0].literature[i].content
            }


            // 准备显示其他盒子（根据需要实现）
            // showOtherBox( item);
        }
    } else {
        // 如果当前项已经激活，则隐藏yellow_bg盒子
        yellowBgDiv.style.visibility = 'hidden'
        yellowBgDiv.style.opacity = 0
        removeActiveClass()
        mainWin.style.opacity = 0
        mainWin.style.visibility = 'hidden'
    }
}

// }
// 示例：根据目录项的内容确定yellow_bg盒子的大小
// function getContentSize(catalogueItem) {
//   // 根据catalogueItem的内容计算并返回大小
//   return { width: 200, height: 300 }; // 示例返回值
// }

// 示例：显示其他盒子的函数
// function showOtherBox(catalogueItem) {
//   // 实现其他盒子的显示逻辑
// }


// ----------------------------------------------------
//百叶窗-----------------

//渲染百叶窗
function addPanels(nowHerbIds, nowCity) {
    // const nowHerbId = nowHerbIds
    panels = document.querySelectorAll('.manyWindows .panel')
    panels.forEach((panel, index) => {
        // console.log(22323);
        const listener = () => updatePanels(panel, index, nowCity, nowHerbIds)
        panel.addEventListener('click', listener)
        listenersMap.set(panel, listener);
    })
}

function updatePanels(panel, index, nowCity, nowHerbId) {
    let contentBox = panel.querySelector('.contentBox')
    let vertical = panel.querySelector('.manyWindows .vertical')
    if (panel.classList.contains('active') && contentBox) {
        vertical.style.opacity = 0
        vertical.style.visibility = 'hidden'
        panel.removeChild(contentBox)
        panel.classList.remove('active')

    } else {
        removeActiveClass()
        panel.classList.add('active')
        contentBox = document.createElement('div')
        contentBox.classList.add('contentBox')
        setTimeout(() => {
            vertical.style.opacity = 1
            vertical.style.visibility = 'visible'
            contentBox.innerHTML = nowCity.herbs[nowHerbId].literature[index].content
        }, 100);
        panel.appendChild(contentBox)
        // console.log(1212);
    }
}

function removeActiveClass() {
    panels.forEach(panel => {
        let contentBox = panel.querySelector('.contentBox')
        let vertical = panel.querySelector('.manyWindows .vertical')
        if (contentBox) {
            panel.removeChild(contentBox)
            vertical.style.opacity = 0
            vertical.style.visibility = 'hidden'
        }
        panel.classList.remove('active')
    })
}
// ----------------------------------
// 草药框架选中
function addClickToFrames(id) {
    frames.forEach(frame => {
        frame.addEventListener('click', () => {
            removeBgcNow()
            // console.log(11);
            frame.style.backgroundColor = 'rgb(226, 205, 180)'
            frame.classList.add('now')
            reset()
            removeCatalogListeners()
            updateContentAndPanels(id)
        })
    })
}

function reset() {
    catalogueItems.forEach(item => item.classList.remove('active'));
    yellowBgDiv.style.opacity = 0
    mainWin.style.opacity = 0
    yellowBgDiv.style.visibility = 'hidden'
    mainWin.style.visibility = 'hidden'
}

function updateContentAndPanels(id) {
    const nowHerbId = getHerbId()
    const nowCity = getAloneData(`${id}`)
    manyWindows = document.querySelector('.manyWindows');
    manyWindows.innerHTML = '';

    createLit(nowCity, nowHerbId)
    getDivPanel()
    addcatalog(id)
    addPanels(nowHerbId, nowCity)
    changeImgRed(id)

    // console.log(111);

}

function removeBgcNow() {
    frames.forEach(frame => {
        frame.style.backgroundColor = null
        frame.classList.remove('now')
    })
}

function changeBigSize(ele, length) {
    if (length * 10 / 5 >= 65) {
        length = 65
        ele.style.width = `${length}vh`
    } else if (length * 5 / 5 <= 40) {
        length = 40
        ele.style.width = `${length}vh`
    } else {
        length *= 5
        ele.style.width = `${length}vh`
    }
    return length
}

function changeSmallSize(ele, length) {
    ele.style.width = `${length - 20}vh`
}

function changeImgRed(id) {
    const nowHerbId = getHerbId()
    // console.log(nowHerbId);
    const nowCity = getAloneData(`${id}`)
    // console.log(nowCity);
    const nowImg = nowCity.herbs[nowHerbId].img
    const herbName = nowCity.herbs[nowHerbId].herbName
    // console.log(nowImg);
    document.querySelector('.herb').style.backgroundImage = `url(${nowImg})`
    if (herbName.length === 2)
        document.querySelector('.red_badge h1').innerHTML = `${herbName[0]} ${herbName[1]}`
    else document.querySelector('.red_badge h1').innerHTML = `${herbName}`
}

function lookReturn(nowCity){
    const a = document.getElementsByTagName('h1')[0]
        let flag = true
        const city=nowCity.cityName
        // console.log(city);
        setInterval(() => {
            if (flag) {
                a.textContent = `${city}`
                if (a.classList.contains('aOut')) {
                    a.classList.remove('aOut')
                }
                if (a.classList.contains('aIn')) {
                    a.classList.remove('aIn')
                }
                a.classList.add('aIn')
                flag = false
                setTimeout(() => {
                    a.classList.add('aOut')
                }, 3500);
            }
            else {
                a.textContent = '返回'
                if (a.classList.contains('aOut')) {
                    a.classList.remove('aOut')
                }
                if (a.classList.contains('aIn')) {
                    a.classList.remove('aIn')
                }
                a.classList.add('aIn')
                flag = true
                setTimeout(() => {
                    a.classList.add('aOut')
                }, 3500);

            }
        }, 5000);
}

document.addEventListener('DOMContentLoaded', () => {
    const id = getUrlParam()
    changeProvinceName(id)
    returnIndex()
    const nowCity = getAloneData(id)
    
    lookReturn(nowCity)
    createHerbs(nowCity)
    changeImgRed(id)
    addHerbsName(nowCity)
    getDivPanel()
    const nowHerbId = getHerbId()
    createLit(nowCity, nowHerbId)
    addPanels(nowHerbId, nowCity)
    getDivPanel()
    addcatalog(id)


    addClickToFrames(id)

})


